app/controllers/tasklist_controller.rb

  def index
    @tasks = Task.all
---
SELECT "tasks".* FROM "tasks"